In [114]:
# Import pandas as pd
import pandas as pd
from datetime import datetime
import numpy as np
from utils import get_movie, get_movie_id, get_movie_data
import requests

class MovieDF(pd.DataFrame):
    
    @classmethod
    def load_file(cls, filename):
        df = pd.read_csv(filename)
        if len(df.columns) > 2:
            raise Exception("The DataFrame must have two columns")
        else:
            return cls(df)
            return print(df)
    
    @classmethod
    def single_movie(cls, movie, year):
        data = [[movie, year]]
        df = pd.DataFrame(data, columns = ['movie', 'year'])
        return cls(df)
        return print(df)
    
    def __init__(self, *args, **kwargs):
        pd.DataFrame.__init__(self, *args, **kwargs)
        self.created_at = datetime.today()
    
    @property
    def get_id_column(self):
        columns = self.columns
        iterator = zip(self[columns[0]], self[columns[1]])
        self["id"] = [get_movie_id(x[0], x[1]) for x in iterator]
        return self
    
    
    def add_new_column(self, column_name):   
        self[column_name] = [get_movie_data(x, column_name) for x in self["id"]]
        return self
    
    def flat_column(self, column):
        
        i = 0
        genres_list = []

        for row in self[column]:
            row_genres = []
            for genre in row:
                row_genres.append(genre["name"])
            genres_list.append(row_genres)
            i += 1
    
        self[column + "_1"] = [row[0] for row in genres_list]
        
        column_2 = []
        
        for row in genres_list:
            try:
                column_2.append(row[1])
            except:
                column_2.append(None)
                
        self[column + "_2"] = column_2      
        
        self.drop(columns = column, axis = 1, inplace = True)
        
        return self
    

mdf = MovieDF({"col1": [1,2], "col2": [3,4]})
print(mdf.values)
print(mdf.created_at)

[[1 3]
 [2 4]]
2021-12-03 18:12:55.819563

In [125]:
df = MovieDF.single_movie("Okja", 2017)

  movie  year
0  Okja  2017

In [116]:
mdf.get_id_column

  movie  year      id
0  Okja  2017  387426

In [117]:
mdf

  movie  year      id
0  Okja  2017  387426

In [118]:
mdf.add_new_column(column_name = "runtime")

  movie  year      id  runtime
0  Okja  2017  387426      122

In [119]:
mdf.add_new_column("genres")

,movie,year,id,runtime,genres
0,Okja,2017,387426,122,"[{'id': 12, 'name': 'Adventure'}, {'id': 18, '..."

In [120]:
mdf.flat_column(column = "genres")

  movie  year      id  runtime   genres_1 genres_2
0  Okja  2017  387426      122  Adventure    Drama

In [121]:
mdf.created_at

datetime.datetime(2021, 12, 3, 18, 12, 56, 175528)

In [122]:
mdf.add_new_column("imdb_id")

  movie  year      id  runtime   genres_1 genres_2    imdb_id
0  Okja  2017  387426      122  Adventure    Drama  tt3967856

In [123]:
mdf.add_new_column("production_countries")

,movie,year,id,runtime,genres_1,genres_2,imdb_id,production_countries
0,Okja,2017,387426,122,Adventure,Drama,tt3967856,"[{'iso_3166_1': 'KR', 'name': 'South Korea'}, ..."

In [124]:
mdf.flat_column("production_countries")

,movie,year,id,runtime,genres_1,genres_2,imdb_id,production_countries_1,production_countries_2
0,Okja,2017,387426,122,Adventure,Drama,tt3967856,South Korea,United States of America